STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/crc_app.c
/**
  ******************************************************************************
 * @file    crc_app.c
 * @author  MCD Application Team
 * @brief   Cable Replacement Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/

#include "app_common.h"

#include "dbg_trace.h"
#include "ble.h"
#include "crc_app.h"
#include "stm32_seq.h"
#include "app_ble.h"
#include "DispTools.h"
#include "stm_queue.h"



/* Private typedef -----------------------------------------------------------*/
typedef enum
{  
  CRC_UNINITIALIZED                                 = 0,
  CRC_INITIALIZED                                   = 1,
  CRC_IDLE                                          = 2,
  CRC_DISCOVER_CHARACS                              = 4,
  CRC_DISCOVER_DESC                                 = 5,
  CRC_READ_TX                                       = 6,
  CRC_READ_RX                                       = 7,
  CRC_READ_RX_CCC                                   = 8,
  CRC_WRITE_TX                                      = 9,
  CRC_ENABLE_RX_NOTIFICATION                        = 10,
  CRC_DISABLE_RX_NOTIFICATION                       = 11,
  CRC_CONNECTED                                     = 12,
  CRC_CONNECTED_ADVERTISING                         = 13
}  CRC_SVC_ProfileState;
  
typedef struct
{
  /**
   * state of the CRC
   * state machine
   */ 
  CRC_SVC_ProfileState state;

  /**
   * connection handle 
   */ 
  uint16_t connHandle;

  /**
   * handle of the CRC service
   */ 
  uint16_t ServiceHandle;

  /**
   * end handle of the CRC service
   */ 
  uint16_t ServiceEndHandle;

  /**
   * handle of the TX characteristic 
   * 
   */ 
  uint16_t TXCharHdle;

  /**
   * handles of the RX characteristic 
   * 
   */ 
  uint16_t RXCharHdle;

  /**
   * handles of the RX Client Characteristic Configuration descriptor 
   * 
   */ 
  uint16_t RXCCCDescHdle;

}CRC_Context_t;


/* Private defines -----------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))

#define READ_RX                                                                0
#define READ_TX                                                                1
#define READ_RX_CCC_DESC                                                       2
          
#define WRITE_TX                                                               0
#define WRITE_ENABLE_RX_NOTIFICATION                                           1
#define WRITE_DISABLE_RX_NOTIFICATION                                          2

#define RX_BUFFER_SIZE                                                        64
#define CR                                                                  0x0d
#define LF                                                                  0x0a
#define POSXRX                                                                10
#define POSYRX                                                                10
#define XSIZE                                                                 10
#define POSXTX                                                                10
#define POSYTX                                                                30
#define YSIZE                                                                 10
#define MAX_STRING_SIZE                                                       20

#define TX_CHAR                                                                1
#define RX_CHAR                                                                2


/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("BLE_APP_CONTEXT") static CRC_Context_t CRC_Context[CFG_MAX_CONNECTION];
static uint8_t waitForComplete;
static uint8_t InputCharFromUart; 
static queue_t RxQueue;
static uint8_t RxQueueBuffer[RX_BUFFER_SIZE];  
static uint8_t PosXTx, PosYTx, PosXRx, PosYRx;
static char szString[MAX_STRING_SIZE+1];
static uint8_t idx;


/* Global variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Functions Definition ------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
static void CRCAPP_Terminal_UART_RxCpltCallback( void );
static void CRCAPP_Terminal_Init(void);

/**
 * @brief  Feature Characteristic write
 * @param  index: characteristic index
 * @retval None
 */
static void CRCAPP_Write_Char(uint8_t index)
{
  uint8_t con_index = 0;
  
  con_index = 0;
  while((con_index < CFG_MAX_CONNECTION) &&
        (CRC_Context[con_index].state != CRC_IDLE))
  {
    switch(index)
    {
      case WRITE_TX:
        {
          APP_DBG_MSG("WRITE_TX\n");
          if(CRC_Context[con_index].TXCharHdle > 0)
          {
            CRC_Context[con_index].state = CRC_WRITE_TX;
            APP_DBG_MSG("CRC_CONNECTED -> CRC_WRITE_TX\n");
            UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
          }
        }
        break;

      case WRITE_ENABLE_RX_NOTIFICATION:
        {
          APP_DBG_MSG("WRITE_ENABLE_RX_NOTIFICATION\n");
          if(CRC_Context[con_index].RXCharHdle > 0)
          {
            CRC_Context[con_index].state = CRC_ENABLE_RX_NOTIFICATION;
            APP_DBG_MSG("CRC_CONNECTED -> CRC_ENABLE_RX_NOTIFICATION\n");
            UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
          }
        }
        break;

      case WRITE_DISABLE_RX_NOTIFICATION:
        {
          APP_DBG_MSG("WRITE_DISABLE_RX_NOTIFICATION\n");
          if(CRC_Context[con_index].RXCharHdle > 0)
          {
            CRC_Context[con_index].state = CRC_DISABLE_RX_NOTIFICATION;
            APP_DBG_MSG("CRC_CONNECTED -> CRC_DISABLE_RX_NOTIFICATION\n");
            UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
          }
        }
        break;
        
      default:
          break;
    }
    con_index++;
  }

}/* end CRCAPP_Write_Char() */


/**
  * @brief  This function handles USARTx interrupt request.
  * @param  None
  * @retval None
  */
static void CRCAPP_Terminal_UART_RxCpltCallback( void )
{
  if(InputCharFromUart == BKSP)
  {
    if(idx > 0)
    {
      idx--;
      PosXTx--;
      PrintPcCrt(PosXTx, PosYTx, " ");
      PrintPcCrt(PosXTx, PosYTx, "");
    }
  }
  else if(InputCharFromUart == CR)
  {
    PosYTx++;
    PosXTx = POSXTX;
    szString[idx] = '\0';
    idx = 0;
    if(PosYTx > POSYTX + YSIZE + 2)
      PosYTx = POSYTX + 2;
    ClearLines(PosYTx, 1);
    PrintPcCrt(PosXTx, PosYTx, "");
    CRCAPP_Write_Char(WRITE_TX);
  }
  else
  {
    char car[2];
    
    car[0] = InputCharFromUart;
    car[1] = 0;
    PrintPcCrt(PosXTx++, PosYTx, "%s", &car[0]);
    szString[idx++] = InputCharFromUart;

    if(idx > MAX_STRING_SIZE - 1)
  {
    szString[idx] = '\0'; 
    idx = 0;
      if(PosXTx > XSIZE)
      {
        PosYTx++;
        PosXTx = POSXTX;
      }
      if(PosYTx > POSYTX + YSIZE + 2)
      {
      PosYTx = POSYTX + 2;
    ClearLines(PosYTx, 1);
    PrintPcCrt(PosXTx, PosYTx, "");
      }
    CRCAPP_Write_Char(WRITE_TX);
  }
  }

  HW_UART_Receive_IT(CFG_CONSOLE_MENU, &InputCharFromUart, 1, CRCAPP_Terminal_UART_RxCpltCallback);
  return;
 }

/**
  * @brief  This function initialize terminal
  * @param  None
  * @retval None
  */
static void CRCAPP_Terminal_Init(void)
{
  HW_UART_Init(CFG_CONSOLE_MENU);

