STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/crc_app.c
  CircularQueue_Init(&RxQueue, RxQueueBuffer, RX_BUFFER_SIZE, 1, CIRCULAR_QUEUE_NO_WRAP_FLAG); 
  
  HW_UART_Receive_IT(CFG_CONSOLE_MENU, &InputCharFromUart, 1, CRCAPP_Terminal_UART_RxCpltCallback);

  return;
}


/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t CRCAPP_Event_Handler(void *Event)
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt *event_pckt;
  evt_blecore_aci *blecore_evt;

  return_value = SVCCTL_EvtNotAck;
  event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);

  switch(event_pckt->evt)
  {
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      {
        blecore_evt = (evt_blecore_aci*)event_pckt->data;

        APP_DBG_MSG("HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE: 0x%x!\n",
                    blecore_evt->ecode);
        
        switch(blecore_evt->ecode)
        {
          case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
            {
              aci_att_read_by_group_type_resp_event_rp0 *pr = (void*)blecore_evt->data;
              uint8_t numServ, i, idx;
              uint16_t handle;
              uint8_t index;

              handle = pr->Connection_Handle;
              index = 0;
              while((index < CFG_MAX_CONNECTION) &&
                    (CRC_Context[index].state != CRC_IDLE))
              {
                APP_BLE_ConnStatus_t status;
                
                status = APP_BLE_Get_Client_Connection_Status(CRC_Context[index].connHandle);
                APP_DBG_MSG("Handle 0x%x status: %d !\n",
                            CRC_Context[index].connHandle, status);
                if(((CRC_Context[index].state == CRC_CONNECTED) ||
                    (CRC_Context[index].state == CRC_CONNECTED_ADVERTISING))&&
                    (status == APP_BLE_IDLE))
                {
                  /* Handle deconnected */
                  APP_DBG_MSG("Handle 0x%x no more connected, connection table updated !\n",
                              CRC_Context[index].connHandle);
                  CRC_Context[index].state = CRC_IDLE;
                  CRC_Context[index].connHandle = 0xFFFF;
                  waitForComplete = 1;
                  break;
                }
                index++;
              }

              if(index < CFG_MAX_CONNECTION)
              {
                CRC_Context[index].connHandle = handle;

                APP_DBG_MSG("New handle 0x%x in connection table index: %d!\n",
                            CRC_Context[index].connHandle, index);
                numServ = pr->Data_Length / pr->Attribute_Data_Length;

                /* the event data will be
                 * 2bytes start handle
                 * 2bytes end handle
                 * 2 or 16 bytes data
                 * we are interested only if the UUID is 128 bits.
                 * So check if the data length is 20
                 */
                if (pr->Attribute_Data_Length == 20)
                {
                  idx = 16;
                  for (i = 0; i < numServ; i++)
                  {
                    uint8_t j;
                    uint8_t service_uuid[] = { CRS_STM_UUID128 };
                    uint8_t result = TRUE;
                    
                    for(j = 0; j < pr->Attribute_Data_Length - 4; j++)
                    {
                      if(pr->Attribute_Data_List[j+4] != service_uuid[(pr->Attribute_Data_Length-5) - j])
                      {
                        result = FALSE;
                        APP_DBG_MSG("Service UUID is not a Cable Replacement Service\n");
                        break;
                      }
                    }
                    if(result == TRUE)
                    {
                      APP_DBG_MSG("ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE, first index in CRC_IDLE state: %d\n", index);
              
                      CRC_Context[index].ServiceHandle = 
                        UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[idx-16]);
                      CRC_Context[index].ServiceEndHandle = 
                        UNPACK_2_BYTE_PARAMETER (&pr->Attribute_Data_List[idx-14]);
                      APP_DBG_MSG("*************************************************************************************************************************\n");
                      APP_DBG_MSG("* Found Cable Replacement service start handle 0x%04x end handle 0x%04x\n",
                                  CRC_Context[index].ServiceHandle,
                                  CRC_Context[index].ServiceEndHandle);
                      APP_DBG_MSG("*************************************************************************************************************************\n");
                      waitForComplete = 1;
                    }
                    idx += 20;
                  }
                }
              }
              else
              {
                APP_DBG_MSG("ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE, failed no free index in connection table !\n");
              }
            }
            break; /*ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE*/
            
          case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
            {
              aci_att_read_by_type_resp_event_rp0 *pr = (void*)blecore_evt->data;
              uint8_t idx;
              uint16_t handle;
              uint8_t index;
              
              index = 0;
              while((index < CFG_MAX_CONNECTION) &&
                    (CRC_Context[index].connHandle != pr->Connection_Handle))
                index++;

              if(index < CFG_MAX_CONNECTION)
              {
                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[0]);
                if((CRC_Context[index].state == CRC_DISCOVER_CHARACS) &&
                   (handle >= CRC_Context[index].ServiceHandle) &&
                   (handle <= CRC_Context[index].ServiceEndHandle))
                {
                  /* Event for CRC Client */
                  APP_DBG_MSG("ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE\n");

                  /* the event data will be
                   * 2 bytes start handle
                   * 1 byte char properties
                   * 2 bytes handle
                   * 2 or 16 bytes data
                   */
                  idx = 17;
                  /* we are interested in only 128 bits UUIDs */
                  if (pr->Handle_Value_Pair_Length == 21)
                  {
                    while(pr->Data_Length > 0)
                    {
                      uint8_t tx_uuid[] = { CRS_STM_TX_UUID128 };
                      uint8_t rx_uuid[] = { CRS_STM_RX_UUID128 };
                      uint8_t i, result = TX_CHAR | RX_CHAR;
                      
                      /* store the characteristic handle not the attribute handle */
                      handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-14]);
                      for(i = 0; i < pr->Handle_Value_Pair_Length - 5; i++)
                      {
                        if(pr->Handle_Value_Pair_Data[i+5] != tx_uuid[(pr->Handle_Value_Pair_Length-6) - i])
                        {
                          APP_DBG_MSG("Characteristic UUID is not a Tx UUID Characteristic\n");
                          APP_DBG_MSG("pr->Handle_Value_Pair_Data[i+5]: 0x%x != tx_uuid[(pr->Handle_Value_Pair_Length-6) - i]: 0x%x\n",
                                      pr->Handle_Value_Pair_Data[i+5],
                                      tx_uuid[(pr->Handle_Value_Pair_Length-6) - i]);
                          result &= RX_CHAR;    /* Not a TX Characteristic */
                        }
                        if(pr->Handle_Value_Pair_Data[i+5] != rx_uuid[(pr->Handle_Value_Pair_Length-6) - i])
                        {
                          APP_DBG_MSG("Characteristic UUID is not a Rx UUID Characteristic\n");
                          APP_DBG_MSG("pr->Handle_Value_Pair_Data[i+5]: 0x%x != rx_uuid[(pr->Handle_Value_Pair_Length-6) - i]: 0x%x\n",
                                      pr->Handle_Value_Pair_Data[i+5],
                                      rx_uuid[(pr->Handle_Value_Pair_Length-6) - i]);
                          result &= TX_CHAR;   /* Not a RX Characteristic */
                        }
                        if(result == 0)
                          break;
                      }
                      if(result == TX_CHAR)
                      {
                        APP_DBG_MSG("*************************************************************************************************************************\n");
                        APP_DBG_MSG("TX start handle 0x%04x\n", UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-17]));
                        APP_DBG_MSG("TX properties   0x%02x\n", pr->Handle_Value_Pair_Data[idx-15]);
                        APP_DBG_MSG("TX handle       0x%04x\n", handle);
                        APP_DBG_MSG("TX uuid           0x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x\n", 
                                    tx_uuid[0], tx_uuid[1], tx_uuid[2],  tx_uuid[3],  tx_uuid[4],  tx_uuid[5],  tx_uuid[6],  tx_uuid[7], 
                                    tx_uuid[8] ,tx_uuid[9], tx_uuid[10], tx_uuid[11], tx_uuid[12], tx_uuid[13], tx_uuid[14], tx_uuid[15]);
                        APP_DBG_MSG("*************************************************************************************************************************\n");
                        CRC_Context[index].TXCharHdle = handle;
                      }

                      if(result == RX_CHAR)
                      {
                        APP_DBG_MSG("*************************************************************************************************************************\n");
                        APP_DBG_MSG("RX start handle 0x%04x\n", UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[idx-17]));
                        APP_DBG_MSG("RX properties   0x%02x\n", pr->Handle_Value_Pair_Data[idx-15]);
                        APP_DBG_MSG("RX handle       0x%04x\n", handle);
                        APP_DBG_MSG("RX uuid           0x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x\n", 
                                    rx_uuid[0], rx_uuid[1], rx_uuid[2],  rx_uuid[3],  rx_uuid[4],  rx_uuid[5],  rx_uuid[6],  rx_uuid[7], 
                                    rx_uuid[8] ,rx_uuid[9], rx_uuid[10], rx_uuid[11], rx_uuid[12], rx_uuid[13], rx_uuid[14], rx_uuid[15]);
                        APP_DBG_MSG("*************************************************************************************************************************\n");
                        CRC_Context[index].RXCharHdle = handle;
                      }
                      pr->Data_Length -= 21;
                      idx += 21;
                    } /* end while(pr->Event_Data_Length > 0) */
                  } /* end if (pr->Handle_Value_Pair_Data == 21) */
                } /* end if(CRC_Context[index].state ... */
              } /* if(index < CFG_MAX_CONNECTION) */
              else
              {
                APP_DBG_MSG("ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
              }
            } 
            break; /*ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE*/
            
          case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
            {
              aci_att_find_info_resp_event_rp0 *pr = (void*)blecore_evt->data;
              uint8_t numDesc, idx, i;
              uint16_t uuid, handle;
              uint8_t index;
              
              index = 0;
              while((index < CFG_MAX_CONNECTION) &&
                    (CRC_Context[index].connHandle != pr->Connection_Handle))
                index++;

