STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/crc_app.c
              if(index < CFG_MAX_CONNECTION)
              {
                handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[0]);
                if((CRC_Context[index].state == CRC_DISCOVER_DESC) &&
                   (handle >= CRC_Context[index].ServiceHandle) &&
                   (handle <= CRC_Context[index].ServiceEndHandle))
                {
                  /* Event for CRC Client */
                  APP_DBG_MSG("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE\n");

                  waitForComplete = 1;
                  /*
                   * event data will be of the format
                   * 2 bytes handle
                   * 2 bytes UUID
                   */

                  numDesc = (pr->Event_Data_Length) / 4;
                  APP_DBG_MSG("CRC Number of descriptors: %d\n", numDesc);
                  
                  /* we are interested only in 16 bit UUIDs */
                  idx = 0;
                  if (pr->Format == UUID_TYPE_16)
                  {
                    for (i = 0; i < numDesc; i++)
                    {
                      handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx]);
                      uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[idx+2]);

                      APP_DBG_MSG("UUID: 0x%x Handle: 0x%x\n", uuid, handle);
                      
                      if(uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID)
                      {
                        if( (CRC_Context[index].RXCharHdle)+1 == handle)
                        {
                          APP_DBG_MSG("*************************************************************************************************************************\n");
                          APP_DBG_MSG("RX Client Characteristic Configuration Desc handle 0x%04x\n", handle);
                          APP_DBG_MSG("RX Client Characteristic Configuration Desc uuid   0x%04x\n", uuid);
                          APP_DBG_MSG("*************************************************************************************************************************\n");
                          CRC_Context[index].RXCCCDescHdle = handle;
                        }
                      } /* end if(uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID) */
                      idx += 4;
                    } /* end for (i = 0; i < numDesc; i++) */
                  } /* end if (pr->Format == UUID_TYPE_16) */
                } /* end if(CRC_Context[index].connHandle == pr->Connection_Handle) */
              }
              else
              {
                APP_DBG_MSG("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
              }
            }
            break; /*ACI_ATT_FIND_INFO_RESP_VSEVT_CODE*/
            
          case ACI_ATT_READ_RESP_VSEVT_CODE:
            {
              aci_att_read_resp_event_rp0 *pr = (void*)blecore_evt->data;
              uint8_t index;
              
              index = 0;
              while((index < CFG_MAX_CONNECTION) &&
                    (CRC_Context[index].connHandle != pr->Connection_Handle))
                index++;

              if(index < CFG_MAX_CONNECTION)
              {
                if(CRC_Context[index].state == CRC_READ_TX)
                {
                  /* Event for CR Client */
                  APP_DBG_MSG("ACI_ATT_READ_RESP_VSEVT_CODE\n");
                  waitForComplete = 1;
                  APP_DBG_MSG("*************************************************************************************************************************\n");
                  APP_DBG_MSG("CRC TX 0x%x:\n",
                               CRC_Context[index].TXCharHdle);
                  APP_DBG_MSG("*************************************************************************************************************************\n");
                }
                else if(CRC_Context[index].state == CRC_READ_RX)
                {
                  /* Event for CR Client */
                  APP_DBG_MSG("ACI_ATT_READ_RESP_VSEVT_CODE\n");
                  waitForComplete = 1;
                  APP_DBG_MSG("*************************************************************************************************************************\n");
                  APP_DBG_MSG("CRC RX 0x%x:\n", 
                               CRC_Context[index].RXCharHdle);
                  APP_DBG_MSG("*************************************************************************************************************************\n");
                }
                else if(CRC_Context[index].state == CRC_READ_RX_CCC)
                {
                  /* Event for CR Client */
                  APP_DBG_MSG("ACI_ATT_READ_RESP_VSEVT_CODE\n");
                  waitForComplete = 1;
                  APP_DBG_MSG("*************************************************************************************************************************\n");
                  APP_DBG_MSG("CRC RX CCC 0x%x: 0x%04x\n", 
                               CRC_Context[index].RXCCCDescHdle,
                               pr->Attribute_Value[0] + (pr->Attribute_Value[1] << 8));
                  APP_DBG_MSG("*************************************************************************************************************************\n");
                }
              }
              else
              {
                APP_DBG_MSG("ACI_ATT_READ_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
              }
            }
            break; /*ACI_ATT_READ_RESP_VSEVT_CODE*/
            
          case ACI_GATT_NOTIFICATION_VSEVT_CODE:
            {
              aci_gatt_notification_event_rp0 *pr = (void*)blecore_evt->data;
              uint8_t index;
              
              index = 0;
              while((index < CFG_MAX_CONNECTION) &&
                    (CRC_Context[index].connHandle != pr->Connection_Handle))
                index++;

              if(index < CFG_MAX_CONNECTION)
              {              
                if((pr->Attribute_Handle >= CRC_Context[index].ServiceHandle) &&
                   (pr->Attribute_Handle <= CRC_Context[index].ServiceEndHandle))
                {
                  /* Event for CRC Client */
                  APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE on connection handle 0x%x\n",
                                  pr->Connection_Handle);
                  waitForComplete = 1;
                  if(pr->Attribute_Handle == CRC_Context[index].RXCharHdle)
                  {
                    uint8_t text[21], i;
                    
