STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/crc_app.c
                    /* the event buffer will have the data as follows:
                     * category ID - 1 byte
                     * number of alerts for that category - 1 byte
                     * text string information - optional(varying number of bytes : the rest
                     * of the available bytes as indicated by length has to be considered
                     * as the string
                     */
                    APP_DBG_MSG("pr->Attribute_Value_Length %d\n", pr->Attribute_Value_Length);
                    for(i = 0; i < pr->Attribute_Value_Length; i++)
                      text[i] = pr->Attribute_Value[i];
                    text[pr->Attribute_Value_Length] = '\0';
                    APP_DBG_MSG("*************************************************************************************************************************\n");
                    APP_DBG_MSG("%s\n", &(text[0]));
                    APP_DBG_MSG("*************************************************************************************************************************\n");
                    if((PosXRx >= XSIZE) || (pr->Attribute_Value_Length < MAX_STRING_SIZE))
                    {
                      PosXRx = POSXRX;
                      PosYRx++;
                      if(PosYRx > POSYRX + YSIZE + 2)
                        PosYRx = POSYRX + 2;
                      ClearLines(PosYRx, 1);
                    }
                    PrintPcCrt(PosXRx, PosYRx, "%s", &(text[0]));
                    PosXRx += pr->Attribute_Value_Length;
                    PrintPcCrt(PosXTx, PosYTx, "");
                  }
                }
              }
              else
              {
                APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
              }
            }
            break; /*ACI_GATT_INDICATION_VSEVT_CODE*/
            
          case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
            {
              aci_gatt_proc_complete_event_rp0 *pr = (void*)blecore_evt->data;

              if(waitForComplete != 0)
              {
                uint8_t index;
                
                index = 0;
                while((index < CFG_MAX_CONNECTION) &&
                      (CRC_Context[index].connHandle != pr->Connection_Handle))
                  index++;

                if(index < CFG_MAX_CONNECTION)
                {
                  waitForComplete = 0;
                  /* Event for CR Client */
                  APP_DBG_MSG("ACI_GATT_PROC_COMPLETE_VSEVT_CODE\n");

                  switch(CRC_Context[index].state)
                  {
                    case CRC_IDLE:
                      {
                        CRC_Context[index].state = CRC_DISCOVER_CHARACS;
                        APP_DBG_MSG("CRC_IDLE -> CRC_DISCOVER_CHARACS\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;
                      
                    case CRC_DISCOVER_CHARACS:
                      {
                        CRC_Context[index].state = CRC_DISCOVER_DESC;
                        APP_DBG_MSG("CRC_DISCOVER_CHARACS -> CRC_DISCOVER_DESC\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;
                      
                    case CRC_DISCOVER_DESC:
                      {
                        CRC_Context[index].state = CRC_ENABLE_RX_NOTIFICATION;
                        APP_DBG_MSG("CRC_DISCOVER_DESC -> CRC_ENABLE_RX_NOTIFICATION\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;
                     
                    case CRC_READ_TX:
                      {
                        CRC_Context[index].state = CRC_CONNECTED;
                        APP_DBG_MSG("CRC_READ_TX -> CRC_CONNECTED\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;
                     
                    case CRC_READ_RX:
                      {
                        CRC_Context[index].state = CRC_CONNECTED;
                        APP_DBG_MSG("CRC_READ_RX -> CRC_CONNECTED\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;
                     
                     
                    case CRC_READ_RX_CCC:
                      {
                        CRC_Context[index].state = CRC_CONNECTED;
                        APP_DBG_MSG("CRC_READ_RX_CCC -> CRC_CONNECTED\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;
                     
                    case CRC_WRITE_TX:
                      {
                        CRC_Context[index].state = CRC_CONNECTED;
                        APP_DBG_MSG("CRC_WRITE_TX -> CRC_CONNECTED\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;

                    case CRC_ENABLE_RX_NOTIFICATION:
                      {
                        ClearScreen();
                        PrintPcCrt(POSXRX, POSXRX, "Receive:");
                        PrintPcCrt(POSXTX, POSYTX, "Transmit:");
                        PrintPcCrt(PosXTx, PosYTx, "");

                        CRC_Context[index].state = CRC_CONNECTED;
                        APP_DBG_MSG("CRC_ENABLE_RX_NOTIFICATION -> CRC_CONNECTED\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;
                     
                    case CRC_DISABLE_RX_NOTIFICATION:
                      {
                        CRC_Context[index].state = CRC_CONNECTED;
                        APP_DBG_MSG("CRC_DISABLE_RX_NOTIFICATION -> CRC_CONNECTED\n");
                        UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
                      }
                      break;

                    default:
                      break;
                  }
                }
                else
                {
                  APP_DBG_MSG("ACI_GATT_PROC_COMPLETE_VSEVT_CODE failed, not found handle in connection table !\n");
                }
              }
            }
            break; /*ACI_GATT_PROC_COMPLETE_VSEVT_CODE*/
            
          case ACI_GATT_ERROR_RESP_VSEVT_CODE:
            {
              aci_gatt_error_resp_event_rp0 *pr = (void*)blecore_evt->data;
              uint8_t index;
              
              index = 0;
              while((index < CFG_MAX_CONNECTION) &&
                    (CRC_Context[index].connHandle != pr->Connection_Handle))
                index++;

