STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/crc_app.c
              if(index < CFG_MAX_CONNECTION)
              {
                if((CRC_Context[index].state == CRC_DISCOVER_CHARACS) &&
                   (waitForComplete == 0) &&
                   (pr->Attribute_Handle >= CRC_Context[index].ServiceHandle) &&
                   (pr->Attribute_Handle <= CRC_Context[index].ServiceEndHandle))
                {
                  APP_DBG_MSG("ACI_GATT_ERROR_RESP_VSEVT_CODE\n");
                  waitForComplete = 1;
                }
                else if((CRC_Context[index].state == CRC_IDLE) &&
                   (waitForComplete == 0) &&
                   (pr->Attribute_Handle >= CRC_Context[index].ServiceHandle) &&
                   (pr->Attribute_Handle <= CRC_Context[index].ServiceEndHandle))
                {
                  APP_DBG_MSG("ACI_GATT_ERROR_RESP_VSEVT_CODE\n");
                  waitForComplete = 1;
                }
              }
              else
              {
                APP_DBG_MSG("ACI_GATT_ERROR_RESP_VSEVT_CODE, not found handle in connection table !\n");
              }
            }
            break; /*ACI_GATT_ERROR_RESP_VSEVT_CODE*/
            
          default:
            break;
        }
      }
      break; /* HCI_HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE_SPECIFIC */
      
    default:
      break;
  }

  return(return_value);
}/* end CRCAPP_Event_Handler */


/* Public functions ----------------------------------------------------------*/
/**
 * @brief  Application initialization
 * @param  None
 * @retval None
 */
void CRCAPP_Init(void)
{
  uint8_t index;
  
  UTIL_SEQ_RegTask( 1<< CFG_TASK_CRC_DISCOVERY_REQ_ID, UTIL_SEQ_RFU, CRCAPP_Update_Service );

  PosXRx = POSXRX;
  PosYRx = POSYRX + 2;
  PosXTx = POSXTX;
  PosYTx = POSYTX + 2;

  CRCAPP_Terminal_Init();

  ClearScreen();

  waitForComplete = 1;

  for(index = 0; index < CFG_MAX_CONNECTION; index++)
  {
    CRC_Context[index].state = CRC_IDLE;
    CRC_Context[index].connHandle = 0xFFFF;
  }

  /**
   *	Register the event handler to the BLE controller
   */
  SVCCTL_RegisterCltHandler(CRCAPP_Event_Handler);

  return;
}


/**
 * @brief  Service update
 * @param  None
 * @retval None
 */
void CRCAPP_Update_Service()
{
  tBleStatus result;
  uint8_t index;
  
  index = 0;
  while((index < CFG_MAX_CONNECTION) &&
        (CRC_Context[index].state != CRC_IDLE))
  {
    switch(CRC_Context[index].state)
    {
      case CRC_CONNECTED:
        {
          APP_DBG_MSG("CRC_CONNECTED\n");
          if(APP_BLE_Get_Client_Connection_Status(CRC_Context[index].connHandle) == APP_BLE_IDLE)
          {
            APP_DBG_MSG("Handle deconnected !\n");
            CRC_Context[index].state = CRC_IDLE;
            CRC_Context[index].connHandle = 0xFFFF;
          }
        }
        break;
        
      case CRC_DISCOVER_CHARACS:
        {
          APP_DBG_MSG("CRC_DISCOVER_CHARACS\n");

          result = aci_gatt_disc_all_char_of_service(CRC_Context[index].connHandle,
                                                     CRC_Context[index].ServiceHandle,
                                                     CRC_Context[index].ServiceEndHandle);

          if( result == BLE_STATUS_SUCCESS )
          {
            APP_DBG_MSG("All characteristics discovery sent successfully \n");
          }
          else 
          {
            APP_DBG_MSG("All characteristics discovery sending failed with result: 0x%x\n", result);
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_IDLE; /* redo a CRC_DISCOVER_CHARACS */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_DISCOVER_CHARACS\n");
            }
          }
        }
        break;
        
      case CRC_DISCOVER_DESC:
        {
          APP_DBG_MSG("CRC_DISCOVER_DESC\n");

          result = aci_gatt_disc_all_char_desc(CRC_Context[index].connHandle,
                                               CRC_Context[index].ServiceHandle,
                                               CRC_Context[index].ServiceEndHandle);
        
          if( result == BLE_STATUS_SUCCESS )
          {
            APP_DBG_MSG("Descriptors discovery sent successfully \n");
          }
          else 
          {
            APP_DBG_MSG("Descriptors discovery sending failed \n");
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_DISCOVER_CHARACS; /* redo a CRC_DISCOVER_DESC */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_DISCOVER_DESC\n");
            }
          }
        }
        break;
        
      case CRC_READ_RX:
        {
          APP_DBG_MSG("CRC_READ_TEMPERATURE_TYPE\n");

          result = aci_gatt_read_char_value(CRC_Context[index].connHandle,
                                            CRC_Context[index].RXCharHdle);
          if( result == BLE_STATUS_SUCCESS )
          {
            APP_DBG_MSG("Read CRC Temperature Type sent successfully \n");
          }
          else 
          {
            APP_DBG_MSG("Read CRC RX sending failed \n");
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_READ_RX; /* redo a CRC_READ_RX */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_READ_RX\n");
            }
          }
        }
        break;
        
      case CRC_READ_TX:
        {
          APP_DBG_MSG("CRC_READ_TX\n");

          result = aci_gatt_read_char_value(CRC_Context[index].connHandle,
                                            CRC_Context[index].TXCharHdle);
          if( result == BLE_STATUS_SUCCESS )
          {
            APP_DBG_MSG("Read CRC TX sent Successfully \n");
          }
          else 
          {
            APP_DBG_MSG("Read TX sent Failed \n");
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_READ_TX; /* redo a CRC_READ_TX */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_READ_TX\n");
            }
          }
        }
        break;
        
