STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_CableReplacement/STM32_WPAN/App/crc_app.c
      case CRC_READ_RX_CCC:
        {
          APP_DBG_MSG("CRC_READ_TEMPERATURE_MEASUREMENT_CCC\n");

          result = aci_gatt_read_char_desc(CRC_Context[index].connHandle,
                                           CRC_Context[index].RXCCCDescHdle);
          if( result == BLE_STATUS_SUCCESS )
          {
            APP_DBG_MSG("Read CRC RX CCCC sent successfully \n");
          }
          else 
          {
            APP_DBG_MSG("Read RX sending failed \n");
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_READ_RX_CCC; /* redo a CRC_READ_RX_CCC */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_READ_RX_CCC\n");
            }
          }
        }
        break;
        
      case CRC_WRITE_TX:
        {
          APP_DBG_MSG("CRC_WRITE_TX\n");

          result = aci_gatt_write_without_resp(CRC_Context[index].connHandle,
                                               CRC_Context[index].TXCharHdle,
                                               strlen(szString),
                                               (uint8_t *) &szString[0]);

          if( result == BLE_STATUS_SUCCESS )
          {
            APP_DBG_MSG("Write CRC TX sent Successfully \n");
            CRC_Context[index].state = CRC_CONNECTED;
            APP_DBG_MSG("CRC_WRITE_TX -> CRC_CONNECTED\n");
            UTIL_SEQ_SetTask( 1<<CFG_TASK_CRC_DISCOVERY_REQ_ID, CFG_SCH_PRIO_0);
          }
          else 
          {
            APP_DBG_MSG("Write TX sent Failed \n");
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_WRITE_TX; /* redo a CRC_WRITE_TX */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_WRITE_TX\n");
            }
          }
        }
        break;
               
      case CRC_ENABLE_RX_NOTIFICATION:
        {
          uint8_t notification[2] = {0x01, 0x00};

          APP_DBG_MSG("CRC_ENABLE_RX_NOTIFICATION\n");

          result = aci_gatt_write_char_desc(CRC_Context[index].connHandle,
                                            CRC_Context[index].RXCCCDescHdle,
                                            2,
                                            (uint8_t *) &notification[0]);
        
          if( result == BLE_STATUS_SUCCESS )
          {
            waitForComplete = 1;
            APP_DBG_MSG("Enable CRC RX Notification Sent Successfully \n");
          }
          else 
          {
            APP_DBG_MSG("Enable CRC RX Notification Sent Failed \n");
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_ENABLE_RX_NOTIFICATION; /* redo a CRC_ENABLE_RX_NOTIFICATION */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_ENABLE_RX_NOTIFICATION\n");
            }
          }
        }
        break;
        
      case CRC_DISABLE_RX_NOTIFICATION:
        {
          uint8_t notification[2] = {0x00, 0x00};
          
          APP_DBG_MSG("CRC_DISABLE_RX_NOTIFICATION\n");

          result = aci_gatt_write_char_desc(CRC_Context[index].connHandle,
                                            CRC_Context[index].RXCCCDescHdle,
                                            2,
                                            (uint8_t *) &notification[0]);
          if( result == BLE_STATUS_SUCCESS )
          {
            waitForComplete = 1;
            APP_DBG_MSG("Disable CRC RX Notification Sent Successfully \n");
          }
          else 
          {
            APP_DBG_MSG("Disable CRC RX Notification Sent Failed \n");
            if(result == BLE_STATUS_NOT_ALLOWED)
            {
              CRC_Context[index].state = CRC_DISABLE_RX_NOTIFICATION; /* redo a CRC_DISABLE_RX_NOTIFICATION */
              waitForComplete = 1;
              APP_DBG_MSG("BLE_STATUS_NOT_ALLOWED do another CRC_DISABLE_RX_NOTIFICATION\n");
            }
          }
        }
        break;

      default:
        break;
    }
    index++;
  }
}

